app/views/favorites/_favorites.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
      <i class="glyphicon glyphicon-heart" aria-hidden="true" ></i>
      <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
      	<i class="glyphicon glyphicon-heart-empty" aria-hidden="true" ></i>
        <%= book.favorites.count %>