app/views/users/show.html.erb

    							<i class="glyphicon glyphicon-heart" aria-hidden="true" ></i>
    							<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

    							<i class="glyphicon glyphicon-heart-empty" aria-hidden="true" ></i>
    							<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

					  <div class="float-wrapper">
    				<div class="comment-count">コメント数：<%= @book.book_comments.count %></div>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]