app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "tesuto"], ["user_id", 1], ["book_id", 3], ["created_at", "2020-11-25 04:16:43.158187"], ["updated_at", "2020-11-25 04:16:43.158187"]]